# Задача
Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решение не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами

# Решение
Console.Clear(); *очистили консоль для удобства*

 string [] arrey=new string [] {"hello", "world", "2", "C#", ":-)" }; *задаем строковый массив*

 string [] finisharrey=new string [arrey.Length]; *задаем новый пустой массив, который будем заполнять элементами после выборки*
 
 void FillArrey (string [] arrey, string [] finisharrey)

*создаем метод для выборки строк, длинна которых будет меньше заданного значения "x" и заполнения нового массива элементами, которые удовлетворяют заданному условию*

 {
    int x = 3;

    for (int i=0; i<arrey.Length; i++)
    {
        {
        if (arrey[i].Length <= x)
        finisharrey[i]=arrey [i];
        }
    }    
 }

 void PrintArrey (string [] arrey)

 *создаем метод для вывода массива на печать*

 {
    for (int i=0; i<arrey.Length; i++)

    {Console.Write ($"{arrey[i]}  ");}
 }

PrintArrey (arrey); *выводим на печать первоначальный массив*

FillArrey (arrey, finisharrey); *заполняем элементами новый массив*

Console.WriteLine(); *разделяем массивы пустой строкой*

PrintArrey (finisharrey); *выводим на печать новый массив*
